POSSIBLE = [ [0,1,0,0,1], [1,0,0,0,1], [1,0,0,0,1], [0,0,0,1,1], [1,1,0,0,1], [1,1,1,0,1], [0,0,1,0,1], [0,1,0,0,1]] 
ONEHOT = [[0] * 9] * 9
for i in range(len(ONEHOT)):
    ONEHOT[i][i] = 1 

CLASS = ['착용샷', '설치 후 배치컷', '발색샷', '요리완성', '미분류']
CATEGORY = ['가구/인테리어','패션의류','패션잡화','식품','생활/건강','출산/육아','화장품/미용','스포츠/레저']

CLASS2LABEL = {class_ : label for class_, label in zip(CLASS,[0,1,2,3,4])}
CAT2POS = { cat : pos for cat,pos in zip(CATEGORY, POSSIBLE)}
CAT2ONEH = {cat : oneh for cat,oneh in zip(CATEGORY, ONEHOT)}
CAT2NUM = { cat : num for cat,num in zip(CATEGORY, range(9))}

CAT22INT = [ 
                ['인테리어소품', '침실가구', '거실가구', '서재/사무용가구','커튼/블라인드','주방가구','침구단품','DIY자재/용품','홈데코','수예','수납가구','카페트/러그','아동/주니어가구','솜류','침구세트','아웃도어가구'],
                ['여성의류','남성의류','여성언더웨어/잠옷','남성언더웨어/잠옷'],
                ['주얼리','여성신발','여성가방','패션소품','남성신발','헤어액세서리','양말','시계','지갑','모자','선글라스/안경테','남성가방','여행용가방/소품','신발용품','벨트','장갑','순금'],
                ['농산물','수산','축산','가공식품','건강식품','냉동/간편조리식품','음료','과자','다이어트식품','김치','반찬','전통주','아이스크림/빙수'],
                ['반려동물'], 
                ['유아동의류','완구/매트','유아동잡화','교재/서적','스킨/바디용품','유아동언더웨어/잠옷','유아침구','이유식용품','유아동 주얼리','출산/돌기념품','유아가구','인형','위생/건강용품','유모차','수유용품','물티슈','신생아의류','외출용품','아기간식','기저귀','수영복/용품','유아발육용품','목욕용품','카시트','임부복','이유식','소독/살균용품','안전용품','구강청결용품','분유','유아세제','임산부용품'],
                ['색조메이크업','네일케어'],
                ['캠핑','헬스','자전거','보호용품','낚시','등산','요가/필라테스','수영','골프','스포츠액세서리','스키/보드','오토바이/스쿠터','축구','스케이트/보드/롤러','댄스','배드민턴','기타스포츠용품','스킨스쿠버',"야구",'탁구','볼링','농구','테니스','수련용품','권투','당구용품','무술용품','인라인스케이트','검도','배구','마라톤용품','스쿼시','족구']
            ]
CAT2NUMELEM = [16, 20, 37, 50, 51, 83, 85, 118]

CAT22ONEH = {'가구/인테리어': {  '인테리어소품': [0, 1, 0, 0, 1], 
                            '침실가구': [0, 1, 0, 0, 1], 
                            '침구단품': [0, 1, 0, 0, 1], 
                            '홈데코': [0, 1, 0, 0, 1], 
                            'DIY자재/용품': [0, 1, 0, 0, 1], 
                            '커튼/블라인드': [0, 1, 0, 0, 1], 
                            '거실가구': [0, 1, 0, 0, 1], 
                            '서재/사무용가구': [0, 1, 0, 0, 1], 
                            '수예': [0, 0, 0, 0, 1], 
                            '솜류': [0, 0, 0, 0, 1], 
                            '카페트/러그': [0, 1, 0, 0, 1], 
                            '주방가구': [0, 1, 0, 0, 1], 
                            '아동/주니어가구': [0, 1, 0, 0, 1], 
                            '아웃도어가구': [0, 1, 0, 0, 1], 
                            '수납가구': [0, 1, 0, 0, 1], 
                            '침구세트': [0, 1, 0, 0, 1]}, 
        '생활/건강': {      '반려동물': [1, 1, 0, 0, 1]}, 
        '스포츠/레저': {    '스포츠액세서리': [1, 0, 0, 0, 1], 
                            '자전거': [1, 0, 0, 0, 1], 
                            '헬스': [0, 0, 0, 0, 1], 
                            '등산': [1, 0, 0, 0, 1], 
                            '보호용품': [1, 0, 0, 0, 1], 
                            '캠핑': [0, 0, 0, 0, 1], 
                            '댄스': [1, 0, 0, 0, 1], 
                            '요가/필라테스': [1, 0, 0, 0, 1], 
                            '스케이트/보드/롤러': [1, 0, 0, 0, 1], 
                            '스킨스쿠버': [1, 0, 0, 0, 1], 
                            '축구': [1, 0, 0, 0, 1], 
                            '기타스포츠용품': [0, 0, 0, 0, 1], 
                            '스키/보드': [1, 0, 0, 0, 1], 
                            '수영': [1, 0, 0, 0, 1], 
                            '골프': [1, 0, 0, 0, 1], 
                            '낚시': [1, 0, 0, 0, 1], 
                            '탁구': [1, 0, 0, 0, 1], 
                            '수련용품': [1, 0, 0, 0, 1], 
                            '오토바이/스쿠터': [1, 0, 0, 0, 1], 
                            '배드민턴': [1, 0, 0, 0, 1], 
                            '농구': [1, 0, 0, 0, 1], 
                            '배구': [0, 0, 0, 0, 1], 
                            '테니스': [1, 0, 0, 0, 1], 
                            '야구': [1, 0, 0, 0, 1], 
                            '권투': [1, 0, 0, 0, 1], 
                            '볼링': [1, 0, 0, 0, 1], 
                            '인라인스케이트': [0, 0, 0, 0, 1], 
                            '당구용품': [0, 0, 0, 0, 1], 
                            '마라톤용품': [0, 0, 0, 0, 1], 
                            '스쿼시': [0, 0, 0, 0, 1], 
                            '검도': [0, 0, 0, 0, 1], 
                            '무술용품': [0, 0, 0, 0, 1], 
                            '족구': [0, 0, 0, 0, 1]}, 
        '식품': {'수산': [0, 0, 0, 1, 1], 
                '가공식품': [0, 0, 0, 1, 1], 
                '농산물': [0, 0, 0, 1, 1], 
                '축산': [0, 0, 0, 1, 1], 
                '건강식품': [0, 0, 0, 0, 1], 
                '음료': [0, 0, 0, 0, 1], 
                '냉동/간편조리식품': [0, 0, 0, 1, 1],
                '다이어트식품': [0, 0, 0, 0, 1], 
                '과자': [0, 0, 0, 0, 1], 
                '아이스크림/빙수': [0, 0, 0, 0, 1], 
                '반찬': [0, 0, 0, 1, 1], 
                '전통주': [0, 0, 0, 1, 1], 
                '김치': [0, 0, 0, 1, 1]}, 
        '출산/육아': {'유아동의류': [1, 0, 0, 0, 1], 
                    '임부복': [1, 0, 0, 0, 1], 
                    '유아동잡화': [1, 0, 0, 0, 1], 
                    '수유용품': [1, 0, 0, 0, 1], 
                    '아기간식': [0, 0, 0, 0, 1], 
                    '구강청결용품': [0, 0, 0, 0, 1], 
                    '수영복/용품': [1, 0, 0, 0, 1], 
                    '유아동언더웨어/잠옷': [1, 0, 0, 0, 1], 
                    '유아동 주얼리': [1, 0, 0, 0, 1], 
                    '물티슈': [0, 0, 0, 0, 1], 
                    '교재/서적': [0, 0, 0, 0, 1], 
                    '완구/매트': [0, 0, 0, 0, 1], 
                    '스킨/바디용품': [0, 0, 1, 0, 1], 
                    '카시트': [0, 0, 0, 0, 1], 
                    '신생아의류': [1, 0, 0, 0, 1], 
                    '유아가구': [0, 1, 0, 0, 1], 
                    '임산부용품': [0, 0, 0, 0, 1], 
                    '위생/건강용품': [0, 0, 0, 0, 1], 
                    '유모차': [0, 0, 0, 0, 1], 
                    '이유식용품': [0, 0, 0, 0, 1], 
                    '유아침구': [0, 0, 0, 0, 1], 
                    '기저귀': [0, 0, 0, 0, 1], 
                    '분유': [0, 0, 0, 0, 1], 
                    '유아발육용품': [0, 0, 0, 0, 1], 
                    '외출용품': [0, 0, 0, 0, 1], 
                    '출산/돌기념품': [1, 0, 0, 0, 1], 
                    '목욕용품': [0, 0, 0, 0, 1], 
                    '인형': [0, 0, 0, 0, 1], 
                    '이유식': [0, 0, 0, 0, 1], 
                    '유아세제': [0, 0, 0, 0, 1], 
                    '안전용품': [0, 1, 0, 0, 1], 
                    '소독/살균용품': [0, 0, 0, 0, 1]}, 
        '패션의류': {'여성의류': [1, 0, 0, 0, 1], 
                    '여성언더웨어/잠옷': [1, 0, 0, 0, 1], 
                    '남성언더웨어/잠옷': [1, 0, 0, 0, 1], 
                    '남성의류': [1, 0, 0, 0, 1]}, 
        '패션잡화': {'여성가방': [1, 0, 0, 0, 1], 
                    '여성신발': [1, 0, 0, 0, 1], 
                    '주얼리': [1, 0, 0, 0, 1], 
                    '시계': [1, 0, 0, 0, 1], 
                    '헤어액세서리': [1, 0, 0, 0, 1], 
                    '남성신발': [1, 0, 0, 0, 1], 
                    '남성가방': [1, 0, 0, 0, 1], 
                    '지갑': [0, 0, 0, 0, 1], 
                    '패션소품': [1, 0, 0, 0, 1], 
                    '여행용가방/소품': [0, 0, 0, 0, 1], 
                    '모자': [1, 0, 0, 0, 1], 
                    '벨트': [1, 0, 0, 0, 1], 
                    '양말': [1, 0, 0, 0, 1], 
                    '신발용품': [0, 0, 0, 0, 1], 
                    '장갑': [1, 0, 0, 0, 1], 
                    '선글라스/안경테': [1, 0, 0, 0, 1], 
                    '순금': [0, 0, 0, 0, 1]}, 
        '화장품/미용': {'색조메이크업': [0, 0, 1, 0, 1], 
                        '네일케어': [0, 0, 1, 0, 1]}}

def cat22idx(category, category2):
    category = CAT2NUM[category]
    category2 = CAT22INT[category].index(category2)
    
    if category == 0:
        idx = category2
    else:
        idx = CAT2NUMELEM[category-1] + category2
    return idx

def cat22oneh(category,category2):
    out = [0] * 118
    category = CAT2NUM[category]
    category2 = CAT22INT[category].index(category2)
    
    if category == 0:
        out[category2] = 1
    else:
        idx = CAT2NUMELEM[category-1] + category2
        out[idx] = 1
    return out

def category_check(train_df):
    labels_unique, counts = np.unique(train_df['category_1'], return_counts=True)
    data={}
    for lu in labels_unique:
        data[lu]={}
    for i in range(len(train_df['category_1'])):
        [c1, c2, _, _, answer, _] = list(train_df.iloc[i])
        if c2 in data[c1]:
            data[c1][c2].add(answer)
        else:
            data[c1][c2] = set([answer])

    return data
#     cate2_key_val={}
#     for d in data:
#         for d2 in data[d]:
#             #print("\t",d2, data[d][d2])
#             key = ' '.join(list(map(str,data[d][d2])))
#             if key in cate2_key_val:
#                 cate2_key_val[key].add(d2)
#             else:
#                 cate2_key_val[key] = set([d2])
#     print("================================")
#     for k in cate2_key_val:
#         idx = list(map(int, k.split()))
#         print(idx,cate2_key_val[k])
#     print("================================")
#     return cate2_key_val

# def get_cate2hot(cate2_str, cate2_key_val):
#     hot = [0,0,0,0,0]
#     for k in cate2_key_val:
#         if cate2_str in cate2_key_val[k]:
#             idx = list(map(int,k.split()))
#             for i in idx:
#                 hot[i] =1
#             break
#     return hot


if __name__ == "__main__":
    l = [len(ele) for ele in CAT22INT]
    print([sum(l[:i+1]) for i,_ in enumerate(l)])
    print(cat22oneh('패션의류','남성의류'))