POSSIBLE = [ [0,1,0,0,1], [1,0,0,0,1], [1,0,0,0,1], [0,0,0,1,1], [1,1,0,0,1], [1,1,1,0,1], [0,0,1,0,1], [0,1,0,0,1]] 
ONEHOT = [[0] * 9] * 9
for i in range(len(ONEHOT)):
    ONEHOT[i][i] = 1 

CLASS = ['착용샷', '설치 후 배치컷', '발색샷', '요리완성', '미분류']
CATEGORY = ['가구/인테리어','패션의류','패션잡화','식품','생활/건강','출산/육아','화장품/미용','스포츠/레저']

CLASS2LABEL = {class_ : label for class_, label in zip(CLASS,[0,1,2,3,4])}
CAT2POS = { cat : pos for cat,pos in zip(CATEGORY, POSSIBLE)}
CAT2ONEH = {cat : oneh for cat,oneh in zip(CATEGORY, ONEHOT)}
CAT2NUM = { cat : num for cat,num in zip(CATEGORY, range(9))}

CAT22INT = [ 
                ['인테리어소품', '침실가구', '거실가구', '서재/사무용가구','커튼/블라인드','주방가구','침구단품','DIY자재/용품','홈데코','수예','수납가구','카페트/러그','아동/주니어가구','솜류','침구세트','아웃도어가구'],
                ['여성의류','남성의류','여성언더웨어/잠옷','남성언더웨어/잠옷'],
                ['주얼리','여성신발','여성가방','패션소품','남성신발','헤어액세서리','양말','시계','지갑','모자','선글라스/안경테','남성가방','여행용가방/소품','신발용품','벨트','장갑','순금'],
                ['농산물','수산','축산','가공식품','건강식품','냉동/간편조리식품','음료','과자','다이어트식품','김치','반찬','전통주','아이스크림/빙수'],
                ['반려동물'], 
                ['유아동의류','완구/매트','유아동잡화','교재/서적','스킨/바디용품','유아동언더웨어/잠옷','유아침구','이유식용품','유아동 주얼리','출산/돌기념품','유아가구','인형','위생/건강용품','유모차','수유용품','물티슈','신생아의류','외출용품','아기간식','기저귀','수영복/용품','유아발육용품','목욕용품','카시트','임부복','이유식','소독/살균용품','안전용품','구강청결용품','분유','유아세제','임산부용품'],
                ['색조메이크업','네일케어'],
                ['캠핑','헬스','자전거','보호용품','낚시','등산','요가/필라테스','수영','골프','스포츠액세서리','스키/보드','오토바이/스쿠터','축구','스케이트/보드/롤러','댄스','배드민턴','기타스포츠용품','스킨스쿠버',"야구",'탁구','볼링','농구','테니스','수련용품','권투','당구용품','무술용품','인라인스케이트','검도','배구','마라톤용품','스쿼시','족구']
            ]
CAT2NUMELEM = [16, 20, 37, 50, 51, 83, 85, 118]

def cat22oneh(category,category2):
    out = [0] * 118
    category = CAT2NUM[category]
    category2 = CAT22INT[category].index(category2)
    
    if category == 0:
        out[category2] = 1
    else:
        idx = CAT2NUMELEM[category-1] + category2
        out[idx] = 1
    return out

if __name__ == "__main__":
    l = [len(ele) for ele in CAT22INT]
    print([sum(l[:i+1]) for i,_ in enumerate(l)])
    print(cat22oneh('패션의류','남성의류'))